{"keras_version": "2.0.5", "config": [{"config": {"name": "embedding_1", "output_dim": 200, "batch_input_shape": [null, 49], "embeddings_initializer": {"config": {"minval": -0.05, "seed": null, "maxval": 0.05}, "class_name": "RandomUniform"}, "input_dim": 17277, "dtype": "int32", "input_length": 49, "mask_zero": false, "activity_regularizer": null, "embeddings_regularizer": null, "embeddings_constraint": null, "trainable": true}, "class_name": "Embedding"}, {"config": {"name": "dropout_1", "rate": 0.35, "trainable": true}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "name": "lstm_1", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dropout": 0.0, "unit_forget_bias": true, "recurrent_constraint": null, "return_sequences": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "unroll": false, "recurrent_regularizer": null, "return_state": false, "use_bias": true, "bias_regularizer": null, "stateful": false, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "implementation": 0, "units": 90, "activation": "tanh", "trainable": true, "go_backwards": false}, "class_name": "LSTM"}, {"config": {"name": "dropout_2", "rate": 0.35, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "dense_1", "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "units": 7, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "trainable": true, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dense_2", "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "units": 6, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "trainable": true, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dense_3", "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "units": 5, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "trainable": true, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dense_4", "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "units": 4, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "trainable": true, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dense_5", "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "units": 3, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "trainable": true, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "activation": "softmax", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential", "backend": "tensorflow"}