{"keras_version": "2.0.5", "config": [{"config": {"mask_zero": false, "embeddings_constraint": null, "output_dim": 200, "name": "embedding_1", "input_dim": 2494, "trainable": true, "batch_input_shape": [null, 19], "dtype": "int32", "input_length": 19, "embeddings_regularizer": null, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "activity_regularizer": null}, "class_name": "Embedding"}, {"config": {"rate": 0.35, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"unroll": false, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "bias_constraint": null, "name": "lstm_1", "trainable": true, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "unit_forget_bias": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "stateful": false, "recurrent_regularizer": null, "activity_regularizer": null, "return_sequences": false, "units": 90, "kernel_constraint": null, "return_state": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "recurrent_constraint": null, "recurrent_dropout": 0.0, "dropout": 0.0, "implementation": 0}, "class_name": "LSTM"}, {"config": {"rate": 0.35, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"units": 7, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "linear", "name": "dense_1", "trainable": true, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"units": 6, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "linear", "name": "dense_2", "trainable": true, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"units": 5, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "linear", "name": "dense_3", "trainable": true, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"units": 4, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "linear", "name": "dense_4", "trainable": true, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"units": 3, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "linear", "name": "dense_5", "trainable": true, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "softmax", "name": "activation_1", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential", "backend": "tensorflow"}